# **SQL Exercise**

## **Activity 1** 

Practice performing CRUD operations (Create, Read, Update, Delete) on a database table.

### **Perform the following tasks:**

1. Connect to the database `abc_corp.db` and create the cursor.

In [1]:
import sqlite3

# Connect to the database
connection = sqlite3.connect('abc_corp.db')

# Create a cursor object
cursor = connection.cursor()

2. `Create` a new table named books, with the following columns:
  * book_id (primary Key)
  * title (Title of the book)
  * author (Author of the book)
  * genre (Genre of the book)
  * publication_year (Year of publication)
  * price (Price of the Book)

In [2]:
import sqlite3

conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

# Create the books table
cursor.execute('''
CREATE TABLE IF NOT EXISTS books (
    book_id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT NOT NULL,
    author TEXT NOT NULL,
    genre TEXT,
    publication_year INTEGER CHECK (publication_year > 0),
    price REAL CHECK (price >= 0)
);
''')

conn.commit()
conn.close()

3. `Insert` at least 5 new books into the books table.

In [3]:
import sqlite3

conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

# Insert 5 new books into the books table
books_to_insert = [
    ('The Great Gatsby', 'F. Scott Fitzgerald', 'Fiction', 1925, 10.99),
    ('To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99),
    ('1984', 'George Orwell', 'Dystopian', 1949, 8.99),
    ('Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99),
    ('The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)
]

cursor.executemany('''
INSERT INTO books (title, author, genre, publication_year, price) 
VALUES (?, ?, ?, ?, ?);
''', books_to_insert)

conn.commit()
conn.close()

4. `Retrieve` all books from the books table.

In [4]:
import sqlite3

conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

# Retrieve all books from the books table
cursor.execute('SELECT * FROM books;')
books = cursor.fetchall()
for book in books:
    print(book)

conn.close()

(2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(3, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(4, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(5, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)
(27, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(28, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(29, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(30, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)
(31, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Fiction', 1925, 10.99)
(32, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(33, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(34, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(35, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)

5. `Update` the price of a specific book.

In [5]:
import sqlite3

conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

# Update the price of a specific book
new_price = 12.99
book_title = 'The Great Gatsby'

cursor.execute('''
UPDATE books
SET price = ?
WHERE title = ?;
''', (new_price, book_title)) 


cursor.execute('SELECT * FROM books;')
books = cursor.fetchall()

for book in books:
    print(book)

conn.commit()
conn.close()

(2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(3, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(4, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(5, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)
(27, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(28, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(29, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(30, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)
(31, 'The Great Gatsby', 'F. Scott Fitzgerald', 'Fiction', 1925, 12.99)
(32, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(33, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(34, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(35, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)

6. `Delete` a book from the table.

In [6]:
import sqlite3


conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

# Delete a specific book by title
book_title = 'The Great Gatsby'

cursor.execute('''
DELETE FROM books
WHERE title = ?;
''', (book_title,))

cursor.execute('SELECT * FROM books;')
books = cursor.fetchall()

for book in books:
    print(book)
conn.commit()
conn.close()

(2, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(3, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(4, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(5, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)
(27, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(28, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(29, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(30, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)
(32, 'To Kill a Mockingbird', 'Harper Lee', 'Fiction', 1960, 7.99)
(33, '1984', 'George Orwell', 'Dystopian', 1949, 8.99)
(34, 'Pride and Prejudice', 'Jane Austen', 'Romance', 1813, 6.99)
(35, 'The Catcher in the Rye', 'J.D. Salinger', 'Fiction', 1951, 9.99)

## **Activity 2** 

Practice using SQL queries with LIMIT, COUNT, and WHERE Clause along with comparison, logical, and special operators.

### **Perform the following tasks:**

1. Create a table named `Students` and add these columns:
  * **student_id** : This column stores the unique identifier for each student, serving as the primary key of the table.
  * **name** : It holds the full name of the student, allowing for the storage of both the first name and last name within a maximum length of 50 characters.
  * **age** : This column represents the age of the student in years, stored as an integer value.
  * **gender** : It stores the gender of the student, allowing for the classification as either "Male" or "Female" within a maximum length of 10 characters.
  * **grade** : This column holds the grade level of the student, typically represented by a single character such as 'A', 'B', 'C', 'D', indicating academic performance or class standing.

In [7]:
import sqlite3

conn = sqlite3.connect('abc_corp.db')
cursor = conn.cursor()

# SQL command to create the Students table
create_table_query = '''
CREATE TABLE IF NOT EXISTS Students (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER NOT NULL,
    gender TEXT CHECK(gender IN ('Male', 'Female')),
    grade TEXT CHECK(grade IN ('A', 'B', 'C', 'D')) NOT NULL
);
'''

cursor.execute(create_table_query)
conn.commit()
conn.close()

print("Table 'Students' created successfully.")

Table 'Students' created successfully.

2. Insert the provided data below into the students table.

| student_id | name             | age | gender | grade |
| ---------- | ---------------- | --- | ------ | ----- |
| 1          | John Di          | 18  | Male   | A     |
| 2          | Emily Clark      | 17  | Female | B     |
| 3          | Michael Santos   | 19  | Male   | C     |
| 4          | Sarah Davis      | 16  | Female | A     |
| 5          | David Poms       | 18  | Male   | B     |
| 6          | Jessica Parker   | 17  | Female | A     |
| 7          | Matthew Ross     | 19  | Male   | D     |
| 8          | Ashey Lim        | 18  | Female | C     |
| 9          | Christopher Chen | 17  | Male   | D     |
| 10         | Amanda Hanes     | 16  | Female | B     |

In [ ]:
import sqlite3

# Connect to the SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect('school.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL command to create the Students table
create_table_query = '''
CREATE TABLE IF NOT EXISTS Students (
    student_id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER NOT NULL,
    gender TEXT CHECK(gender IN ('Male', 'Female')),
    grade TEXT CHECK(grade IN ('A', 'B', 'C', 'D')) NOT NULL
);
'''

# Execute the SQL command to create the table
cursor.execute(create_table_query)

# List of students to insert
students = [
    (1, 'John Di', 18, 'Male', 'A'),
    (2, 'Emily Clark', 17, 'Female', 'B'),
    (3, 'Michael Santos', 19, 'Male', 'C'),
    (4, 'Sarah Davis', 16, 'Female', 'A'),
    (5, 'David Poms', 18, 'Male', 'B'),
    (6, 'Jessica Parker', 17, 'Female', 'A'),
    (7, 'Matthew Ross', 19, 'Male', 'D'),
    (8, 'Ashey Lim', 18, 'Female', 'C'),
    (9, 'Christopher Chen', 17, 'Male', 'D'),
    (10, 'Amanda Hanes', 16, 'Female', 'B')
]

# SQL command to insert students
insert_student_query = '''
INSERT INTO Students (student_id, name, age, gender, grade)
VALUES (?, ?, ?, ?, ?);
'''

# Insert each student into the Students table
cursor.executemany(insert_student_query, students)
conn.commit()
conn.close()

print("Data inserted successfully into the 'Students' table.")

OperationalError: database is locked

3. Retrieve only the name and grade columns for all students.

In [11]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select only the name and grade columns from the Students table
select_query = '''
SELECT name, grade FROM Students;
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Name and Grade of Students:")
for row in results:
    print(f"Name: {row[0]}, Grade: {row[1]}")

# Close the connection
conn.close()

Name and Grade of Students:
Name: John Di, Grade: A
Name: Emily Clark, Grade: B
Name: Michael Santos, Grade: C
Name: Sarah Davis, Grade: A
Name: David Poms, Grade: B
Name: Jessica Parker, Grade: A
Name: Matthew Ross, Grade: D
Name: Ashey Lim, Grade: C
Name: Christopher Chen, Grade: D
Name: Amanda Hanes, Grade: B

4. Retrieve male students older than 18 years old.

In [12]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select male students older than 18 years
select_query = '''
SELECT * FROM Students
WHERE gender = 'Male' AND age > 18;
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Male Students Older Than 18 Years:")
for row in results:
    print(f"Student ID: {row[0]}, Name: {row[1]}, Age: {row[2]}, Gender: {row[3]}, Grade: {row[4]}")

# Close the connection
conn.close()

Male Students Older Than 18 Years:
Student ID: 3, Name: Michael Santos, Age: 19, Gender: Male, Grade: C
Student ID: 7, Name: Matthew Ross, Age: 19, Gender: Male, Grade: D

5. Retrieve the name and age of students who are older than or equal to 18.

In [13]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select female students younger than 18 years
select_query = '''
SELECT * FROM Students
WHERE gender = 'Female' AND age < 18;
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Female Students Younger Than 18 Years:")
for row in results:
    print(f"Student ID: {row[0]}, Name: {row[1]}, Age: {row[2]}, Gender: {row[3]}, Grade: {row[4]}")

# Close the connection
conn.close()

Female Students Younger Than 18 Years:
Student ID: 2, Name: Emily Clark, Age: 17, Gender: Female, Grade: B
Student ID: 4, Name: Sarah Davis, Age: 16, Gender: Female, Grade: A
Student ID: 6, Name: Jessica Parker, Age: 17, Gender: Female, Grade: A
Student ID: 10, Name: Amanda Hanes, Age: 16, Gender: Female, Grade: B

6. Retrieve the name and gender of students who are either 16 years old or have a grade of 'A'.

In [14]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select name and gender of students who are either 16 years old or have a grade of 'A'
select_query = '''
SELECT name, gender FROM Students
WHERE age = 16 OR grade = 'A';
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Students Who Are 16 Years Old or Have a Grade of 'A':")
for row in results:
    print(f"Name: {row[0]}, Gender: {row[1]}")

# Close the connection
conn.close()

Students Who Are 16 Years Old or Have a Grade of 'A':
Name: John Di, Gender: Male
Name: Sarah Davis, Gender: Female
Name: Jessica Parker, Gender: Female
Name: Amanda Hanes, Gender: Female

7. Retrieve the name, age, and grade of female students who are younger than 18.

In [15]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select name, age, and grade of female students who are younger than 18
select_query = '''
SELECT name, age, grade FROM Students
WHERE gender = 'Female' AND age < 18;
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Female Students Younger Than 18:")
for row in results:
    print(f"Name: {row[0]}, Age: {row[1]}, Grade: {row[2]}")

# Close the connection
conn.close()

Female Students Younger Than 18:
Name: Emily Clark, Age: 17, Grade: B
Name: Sarah Davis, Age: 16, Grade: A
Name: Jessica Parker, Age: 17, Grade: A
Name: Amanda Hanes, Age: 16, Grade: B

8. Retrieve the count of male students.

In [17]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to count the number of male students
count_query = '''
SELECT COUNT(*) FROM Students
WHERE gender = 'Male';
'''

# Execute the query
cursor.execute(count_query)

# Fetch the result
count_result = cursor.fetchone()

# Print the count of male students
print(f"Count of Male Students: {count_result[0]}")

# Close the connection
conn.close()

Count of Male Students: 5

9. Retrieve the students who are between 16 or 19 years old.

In [18]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select students who are either 16 or 19 years old
select_query = '''
SELECT * FROM Students
WHERE age = 16 OR age = 19;
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Students Who Are 16 or 19 Years Old:")
for row in results:
    print(row)

# Close the connection
conn.close()

Students Who Are 16 or 19 Years Old:
(3, 'Michael Santos', 19, 'Male', 'C')
(4, 'Sarah Davis', 16, 'Female', 'A')
(7, 'Matthew Ross', 19, 'Male', 'D')
(10, 'Amanda Hanes', 16, 'Female', 'B')

10. Retrieve the name and grade of students whose grades are 'B' or 'C' and are older than or equal to 18 years old.

In [19]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select name and grade of students with grades 'B' or 'C' and age >= 18
select_query = '''
SELECT name, grade FROM Students
WHERE (grade = 'B' OR grade = 'C') AND age >= 18;
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Students with Grades 'B' or 'C' and Age >= 18:")
for row in results:
    print(f"Name: {row[0]}, Grade: {row[1]}")

# Close the connection
conn.close()

Students with Grades 'B' or 'C' and Age >= 18:
Name: Michael Santos, Grade: C
Name: David Poms, Grade: B
Name: Ashey Lim, Grade: C

11. Retrieve the name and age of students whose names start with 'A'.

In [20]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select name and age of students whose names start with 'A'
select_query = '''
SELECT name, age FROM Students
WHERE name LIKE 'A%';
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("Students Whose Names Start with 'A':")
for row in results:
    print(f"Name: {row[0]}, Age: {row[1]}")

# Close the connection
conn.close()

Students Whose Names Start with 'A':
Name: Ashey Lim, Age: 18
Name: Amanda Hanes, Age: 16

12. Retrieve the first 5 students whose names contain the letter 'i'.

In [21]:
import sqlite3

# Connect to the SQLite database
conn = sqlite3.connect('abc_corp.db')

# Create a cursor object to execute SQL commands
cursor = conn.cursor()

# SQL query to select the first 5 students whose names contain the letter 'i'
select_query = '''
SELECT * FROM Students
WHERE name LIKE '%i%'
LIMIT 5;
'''

# Execute the query
cursor.execute(select_query)

# Fetch all results
results = cursor.fetchall()

# Print the results
print("First 5 Students Whose Names Contain the Letter 'i':")
for row in results:
    print(row)

# Close the connection
conn.close()

First 5 Students Whose Names Contain the Letter 'i':
(1, 'John Di', 18, 'Male', 'A')
(2, 'Emily Clark', 17, 'Female', 'B')
(3, 'Michael Santos', 19, 'Male', 'C')
(4, 'Sarah Davis', 16, 'Female', 'A')
(5, 'David Poms', 18, 'Male', 'B')